pkg/wsman/wsmantesting/responses/cim/bios/element/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_BIOSElement"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000E32</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_BIOSElement</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_BIOSElement>
            <g:ElementName>Primary BIOS</g:ElementName>
            <g:Manufacturer>Intel Corp.</g:Manufacturer>
            <g:Name>Primary BIOS</g:Name>
            <g:OperationalStatus>0</g:OperationalStatus>
            <g:PrimaryBIOS>true</g:PrimaryBIOS>
            <g:ReleaseDate>
                <h:Datetime>2020-08-10T00:00:00Z</h:Datetime>
            </g:ReleaseDate>
            <g:SoftwareElementID>QNCFLX70.0054.2020.0810.2227</g:SoftwareElementID>
            <g:SoftwareElementState>2</g:SoftwareElementState>
            <g:TargetOperatingSystem>66</g:TargetOperatingSystem>
            <g:Version>QNCFLX70.0054.2020.0810.2227</g:Version>
        </g:CIM_BIOSElement>
    </a:Body>
</a:Envelope>